In [2]:
import pandas as pd
df=pd.read_csv("100_students_dataset.csv")
df

,StudentID,Name,Age,Gender,Department,Attendance,CGPA,City,HostelResident,Scholarship
0,1,Allison Hill,18,Male,EEE,54.7,4.84,Chennai,Yes,No
1,2,Noah Rhodes,17,Male,CSE,53.1,7.03,Chennai,Yes,No
2,3,Angie Henderson,20,Female,CIVIL,56.7,9.22,Pune,Yes,No
3,4,Daniel Wagner,22,Female,ECE,52.9,8.58,Chennai,Yes,No
4,5,Cristian Santos,18,Female,EEE,76.2,8.84,Hyderabad,No,Yes
...,...,...,...,...,...,...,...,...,...,...
95,96,Anna Henderson,24,Male,CSE,64.0,4.44,Hyderabad,Yes,Yes
96,97,Aaron Wise,19,Other,EEE,45.1,5.49,Kolkata,No,Yes
97,98,Deborah Figueroa,25,Female,MECH,94.5,5.78,Kolkata,No,No
98,99,Jessica Smith,17,Other,CSE,96.9,5.25,Bangalore,No,Yes
99,100,Stephen Mckee,19,Male,ECE,73.1,4.94,Delhi,No,No

In [3]:
df.head(2)

,StudentID,Name,Age,Gender,Department,Attendance,CGPA,City,HostelResident,Scholarship
0,1,Allison Hill,18,Male,EEE,54.7,4.84,Chennai,Yes,No
1,2,Noah Rhodes,17,Male,CSE,53.1,7.03,Chennai,Yes,No

In [4]:
df.tail(5)

,StudentID,Name,Age,Gender,Department,Attendance,CGPA,City,HostelResident,Scholarship
95,96,Anna Henderson,24,Male,CSE,64.0,4.44,Hyderabad,Yes,Yes
96,97,Aaron Wise,19,Other,EEE,45.1,5.49,Kolkata,No,Yes
97,98,Deborah Figueroa,25,Female,MECH,94.5,5.78,Kolkata,No,No
98,99,Jessica Smith,17,Other,CSE,96.9,5.25,Bangalore,No,Yes
99,100,Stephen Mckee,19,Male,ECE,73.1,4.94,Delhi,No,No